<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"35e8ca0c4b8e9cbd5395d9d0354d28f283edce2bba572acfa0187b76a59fd78d","plan_job_ref":"Job Plan Airflow DAGs #396 at https://github.com/cal-itp/data-infra/actions/runs/16534036726","plan_out_hash":"b5807312837d7b1d302109c28d1dfba9bf57246e6aa070886ca46c841a56c577","plan_hash":"2f3f1653ff1cd185a8448f1908e677658fe669fdd9b79f5b9f437823001077d3","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 8 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "9LeAwg==" -> (known after apply)
!~      detect_md5hash      = "seFuhO6op83J90oCixwTxQ==" -> "different hash"
!~      generation          = 1753406559845657 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "seFuhO6op83J90oCixwTxQ==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["macros/gtfs_rt_stg_outcomes.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "YMHdGA==" -> (known after apply)
!~      detect_md5hash      = "hpbmvkOQUTAs6tg4ZRiAVg==" -> "different hash"
!~      generation          = 1753406559617369 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/macros/gtfs_rt_stg_outcomes.sql"
!~      md5hash             = "hpbmvkOQUTAs6tg4ZRiAVg==" -> (known after apply)
        name                = "data/warehouse/macros/gtfs_rt_stg_outcomes.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["macros/gtfs_rt_stg_validation_notices.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "ij73Nw==" -> (known after apply)
!~      detect_md5hash      = "tNLVQGl2WM335kK5DNLuyQ==" -> "different hash"
!~      generation          = 1753406558757679 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/macros/gtfs_rt_stg_validation_notices.sql"
!~      md5hash             = "tNLVQGl2WM335kK5DNLuyQ==" -> (known after apply)
        name                = "data/warehouse/macros/gtfs_rt_stg_validation_notices.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs/fct_vehicle_positions_trip_metrics.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "5ou0YA==" -> (known after apply)
!~      detect_md5hash      = "9wxIDNgZNMLnOqGDk+ID5A==" -> "different hash"
!~      generation          = 1752161968058803 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/gtfs/fct_vehicle_positions_trip_metrics.sql"
!~      md5hash             = "9wxIDNgZNMLnOqGDk+ID5A==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_vehicle_positions_trip_metrics.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/staging/gtfs/stg_gtfs_rt__service_alerts.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "mBB5KQ==" -> (known after apply)
!~      detect_md5hash      = "KCesbbSqtO7PwkhMZX2tXg==" -> "different hash"
!~      generation          = 1753406558754056 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/staging/gtfs/stg_gtfs_rt__service_alerts.sql"
!~      md5hash             = "KCesbbSqtO7PwkhMZX2tXg==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs/stg_gtfs_rt__service_alerts.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/staging/gtfs/stg_gtfs_rt__trip_updates.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "1P0FGg==" -> (known after apply)
!~      detect_md5hash      = "5pGueCChIH71U3b/Vh3FqQ==" -> "different hash"
!~      generation          = 1753406558749464 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/staging/gtfs/stg_gtfs_rt__trip_updates.sql"
!~      md5hash             = "5pGueCChIH71U3b/Vh3FqQ==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs/stg_gtfs_rt__trip_updates.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/staging/gtfs/stg_gtfs_rt__vehicle_positions.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "RPmKBw==" -> (known after apply)
!~      detect_md5hash      = "nrdBPMlP5jL9xirJR8jsGg==" -> "different hash"
!~      generation          = 1753406558753823 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/staging/gtfs/stg_gtfs_rt__vehicle_positions.sql"
!~      md5hash             = "nrdBPMlP5jL9xirJR8jsGg==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs/stg_gtfs_rt__vehicle_positions.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "1Ymikw==" -> (known after apply)
!~      detect_md5hash      = "4rSvwi1uqvTgsvaqF1oBSg==" -> "different hash"
!~      generation          = 1753406561213952 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "4rSvwi1uqvTgsvaqF1oBSg==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 8 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #396](https://github.com/cal-itp/data-infra/actions/runs/16534036726)